[
  {
    "name": "Iphone 14 Plus",
    "companyName": "Apple",
    "description": "Introducing the latest iPhone, a cutting-edge blend of sleek design and powerful performance. Experience unparalleled speed with its advanced processor, capture stunning moments with the high-quality camera, and enjoy the immersive display for vibrant visuals. With seamless integration of innovative features, this iPhone is not just a phone but a lifestyle companion. Elevate your mobile experience with the epitome of style and technology.",
    "imageUrl": "iphone.jpg",
    "price": 999.99,
    "type": "electronic",
    "discountPercentage": 16,
    "rating": 4.8
  },
  {
    "name": "Macbook Air",
    "companyName": "Apple",
    "type": "electronic",
    "description": "Meet the MacBook Air, a sleek and ultra-portable powerhouse designed for those who demand style and performance. With a stunning Retina display, a responsive Magic Keyboard, and the powerful Apple M1 chip, the MacBook Air delivers a seamless and efficient computing experience. Immerse yourself in the world of creativity and productivity with this iconic laptop.",
    "imageUrl": "macbook.jpg",
    "price": 1199.99,
    "discountPercentage": 12,
    "rating": 4.8
  },
  {
    "name": "Ipad Pro",
    "companyName": "Apple",
    "type": "electronic",
    "description": "Elevate your digital experience with the iPad Pro. This cutting-edge tablet combines power and versatility, featuring the incredible performance of the Apple M1 chip, a Liquid Retina XDR display, and the intuitive Apple Pencil support. Whether you're a creative professional or a multitasking enthusiast, the iPad Pro redefines what a tablet can do. Unleash your creativity, productivity, and entertainment on the go.",
    "imageUrl": "ipad.jpg",
    "price": 699.99,
    "discountPercentage": 8,
    "rating": 4.6
  },
  {
    "name": "PS5",
    "companyName": "Sony",
    "type": "electronic",
    "description": "Unleash the power of next-gen gaming with the PlayStation 5. Immerse yourself in breathtaking graphics, lightning-fast load times, and an expansive gaming library. Elevate your gaming experience to new heights with the cutting-edge technology of the PS5.",
    "imageUrl": "ps5.jpg",
    "price": 799.99,
    "discountPercentage": 8,
    "rating": 4.8
  },
  {
    "name": "Xbox Series X",
    "companyName": "Microsoft",
    "type": "electronic",
    "description": "Experience gaming like never before with the Xbox Series X. Boasting 4K visuals, rapid load times, and a vast gaming ecosystem, this console is designed for true enthusiasts. Unleash the power of immersive gaming and unparalleled performance.",
    "imageUrl": "xbox-series-x.jpg",
    "price": 599.99,
    "discountPercentage": 10,
    "rating": 4.7
  },
  {
    "name": "Acer Monitor",
    "companyName": "ACER",
    "type": "electronic",
    "description": "Enhance your visual experience with our high-quality monitor. Crisp, vibrant visuals meet ergonomic design, offering a perfect balance between style and functionality. Whether for work or play, this monitor delivers stunning clarity and smooth performance.",
    "imageUrl": "acer-monitor.jpg",
    "price": 129.99,
    "discountPercentage": 8,
    "rating": 4.1
  },
  {
    "name": "Gaming Monitor",
    "companyName": "LG",
    "type": "electronic",
    "description": "Enhance your visual experience with our high-quality monitor. Crisp, vibrant visuals meet ergonomic design, offering a perfect balance between style and functionality. Whether for work or play, this monitor delivers stunning clarity and smooth performance.",
    "imageUrl": "gaming-monitor.jpg",
    "price": 199.99,
    "discountPercentage": 12,
    "rating": 4.4
  },
  {
    "name": "Logitech G305",
    "companyName": "Logitech",
    "type": "electronic",
    "description": "Navigate your digital world with precision using our high-performance mouse. Designed for comfort and accuracy, it's the perfect tool for work or play. Experience smooth control and efficiency at your fingertips.",
    "imageUrl": "logitech-g305.jpg",
    "price": 69.99,
    "discountPercentage": 8,
    "rating": 4.3
  },
  {
    "name": "Chevron K8",
    "companyName": "Chevron",
    "type": "electronic",
    "description": "Unleash your productivity with our sleek keyboard. Whether you're a gamer or a professional, this keyboard offers a tactile and responsive typing experience. Elevate your efficiency with a blend of style and functionality.",
    "imageUrl": "chevron-k8.jpg",
    "price": 149.99,
    "discountPercentage": 6,
    "rating": 4.1
  },
  {
    "name": "Ryzen 3700x",
    "companyName": "AMD",
    "type": "electronic",
    "description": "Power up your system with the AMD Ryzen 3700X processor. Delivering exceptional performance for gaming and multitasking, it's the heart of a high-performance computing experience. Unleash the potential of your rig with this powerhouse.",
    "imageUrl": "amd-ryzen-3700x.jpg",
    "price": 349.99,
    "discountPercentage": 10,
    "rating": 4.7
  },
  {
    "name": "i5 9600k",
    "companyName": "Intel",
    "type": "electronic",
    "description": "Experience seamless computing with the Intel Core i5 9600 processor. Perfect for both work and play, this processor offers a balance of performance and efficiency. Upgrade your system and enjoy responsive, reliable computing power.",
    "imageUrl": "intel-i5-9600k.jpg",
    "price": 299.99,
    "discountPercentage": 8,
    "rating": 4.6
  },
  {
    "name": "Razor Cyberpunk 2077 Mouse",
    "companyName": "Razor",
    "type": "electronic",
    "description": "Introducing the Razor Cyberpunk 2077 Special Edition Mouse, a gaming accessory that brings the futuristic and immersive world of Cyberpunk 2077 to your fingertips. Designed with the iconic Cyberpunk aesthetic, this mouse combines style with precision gaming performance. Immerse yourself in the action with customizable RGB lighting, responsive buttons, and a comfortable ergonomic design. Elevate your gaming experience and dive into the cyber-enhanced universe with the Razor Cyberpunk 2077 Special Edition Mouse.",
    "imageUrl": "razor-cyberpunk-2077-mouse.jpg",
    "price": 799.99,
    "discountPercentage": 2,
    "rating": 4.8
  },
  {
    "name": "Xbox Series Controller",
    "companyName": "Microsoft",
    "type": "electronic",
    "description": "Elevate your gaming with the Xbox Controller. Ergonomically designed for maximum comfort and precision, it's the perfect companion for your Xbox console. Responsive controls and a sleek design ensure a seamless gaming experience.",
    "imageUrl": "xbox-series-controller.jpg",
    "price": 79.99,
    "discountPercentage": 10,
    "rating": 4.6
  },
  {
    "name": "Dual Shock 4",
    "companyName": "Sony",
    "type": "electronic",
    "description": "Dive into the world of PlayStation gaming with the DualShock 4 controller. Its intuitive design, precise controls, and innovative features make it the ideal choice for immersive gameplay. Take control and elevate your gaming sessions.",
    "imageUrl": "dual-shock-4.jpg",
    "price": 89.99,
    "discountPercentage": 8,
    "rating": 4.2
  },
  {
    "name": "samsung Galaxy Flip",
    "companyName": "Samsung",
    "type": "electronic",
    "description": "Redefine mobile innovation with the Samsung Galaxy Flip. This foldable masterpiece combines style with functionality, featuring a stunning display, powerful camera, and compact design. Embrace a new era of smartphone technology.",
    "imageUrl": "samsung-galaxy-flip.jpg",
    "price": 799.99,
    "discountPercentage": 25,
    "rating": 3.2
  },
  {
    "name": "Pink Dress",
    "companyName": null,
    "type": "fashion",
    "description": "Step into a world of whimsy and charm with our pink girl's dress, a delightful blend of sweetness and elegance. Crafted with soft, luxurious fabric and adorned with delicate embellishments, this dress radiates femininity and grace. The gentle hue of pink evokes feelings of joy and innocence, making it the perfect choice for any special occasion. Whether twirling at a party or embracing everyday magic, this dress is sure to make her feel like a princess.",
    "imageUrl": "pink-dress.jpg",
    "price": 149.99,
    "discountPercentage": 25,
    "rating": 4.1
  },
  {
    "name": "White Dress",
    "companyName": null,
    "type": "fashion",
    "description": "Discover the epitome of grace and style with our collection of girl's dresses. Each piece is meticulously designed to exude charm and sophistication, offering a perfect blend of comfort and elegance. From playful prints to timeless classics, our dresses are crafted to make every young girl feel like royalty. Embrace the joy of dressing up and create unforgettable moments with our enchanting selection.",
    "imageUrl": "white-dress.jpg",
    "price": 99.99,
    "discountPercentage": 15,
    "rating": 4.3
  },
  {
    "name": "Green White Dress",
    "companyName": null,
    "type": "fashion",
    "description": "Indulge in the magic of childhood with this enchanting young girl dress, tailored for the modern princess within you. With its whimsical design and soft, flowing fabric, this dress invites you to embrace your inner elegance and grace. Whether for a special event or a day of play, let this dress be your companion in creating cherished memories and timeless moments. Step into a world of enchantment and make every day a fairy tale come true.",
    "imageUrl": "green-white-dress.jpg",
    "price": 229.99,
    "discountPercentage": 25,
    "rating": 4.4
  },
  {
    "name": "White Dress Pair",
    "companyName": null,
    "type": "fashion",
    "description": "Evoke an aura of purity and grace with this exquisite pair of white girl's dresses, crafted to illuminate innocence and charm. Each dress embodies timeless elegance, featuring delicate lace accents and flowing silhouettes that evoke a sense of ethereal beauty. Whether twirling at a special occasion or simply enjoying a day of play, these dresses exude sophistication and grace. Let them be a symbol of purity and elegance as you create enchanting memories together.",
    "imageUrl": "white-dress-pair.jpg",
    "price": 549.99,
    "discountPercentage": 12,
    "rating": 4.8
  },
  {
    "name": "Purple Dress",
    "companyName": null,
    "type": "fashion",
    "description": "Indulge in the magic of childhood with this enchanting young girl dress, tailored for the modern princess within you. With its whimsical design and soft, flowing fabric, this dress invites you to embrace your inner elegance and grace. Whether for a special event or a day of play, let this dress be your companion in creating cherished memories and timeless moments. Step into a world of enchantment and make every day a fairy tale come true.",
    "imageUrl": "purple-dress.jpg",
    "price": 299.99,
    "discountPercentage": 15,
    "rating": 4.5
  },
  {
    "name": "Red Dress",
    "companyName": null,
    "type": "fashion",
    "description": "Ignite your confidence and charm with this stunning red girl's dress, a vibrant expression of boldness and grace. Crafted with luxurious fabric and adorned with intricate details, this dress is more than just clothing; it's a statement of individuality and style. Embrace the power of red as you step into the spotlight, radiating elegance and poise with every twirl. Whether for a special occasion or a moment of self-celebration, let this dress be your symbol of beauty and strength.",
    "imageUrl": "red-dress.jpg",
    "price": 199.99,
    "discountPercentage": 5,
    "rating": 4.6
  },
  {
    "name": "Green Dress",
    "companyName": null,
    "type": "fashion",
    "description": "Indulge in the magic of childhood with this enchanting young girl dress, tailored for the modern princess within you. With its whimsical design and soft, flowing fabric, this dress invites you to embrace your inner elegance and grace. Whether for a special event or a day of play, let this dress be your companion in creating cherished memories and timeless moments. Step into a world of enchantment and make every day a fairy tale come true.",
    "imageUrl": "green-dress.jpg",
    "price": 99.99,
    "discountPercentage": 18,
    "rating": 4.1
  }
]
